{
  "保定市祈德新能源科技有限公司": "Baoding Qide New Energy Technology Co Co., Ltd.",
  "石家庄滨矿商贸有限公司": "Shijiazhuang Bin Mining Trading Co Co., Ltd.",
  "大同市新荣区光盈新能源有限公司": "Datong Xinrong District Guangying New Energy Co Co., Ltd.",
  "保定市雄飞建材有限公司": "Baoding Xiongfei Building Materials Co Co., Ltd.",
  "成都市晨曦电力有限责任公司": "Chengdu Chenxi Electric Power Co Co., Ltd.",
  "山西东方聚源运输服务有限公司": "Shanxi Oriental Juyuan Transportation Service Co Co., Ltd.",
  "黎城县鑫兴汽车贸易有限公司": "Licheng County Xinxing Automobile Trading Co Co., Ltd.",
  "成都天投实业有限公司": "Chengdu Tiantou Industrial Co Co., Ltd.",
  "焦作路安新能源科技有限公司": "Jiaozuo Luan New Energy Technology Co Co., Ltd.",
  "泉州市万邦物业服务有限公司南安分公司": "Quanzhou Wanbang Property Service Co., . Nan'an Branch Co., Ltd.",
  "河北燕山钢铁集团有限公司": "Hebei Yanshan Iron and Steel Group Co Co., Ltd.",
  "重庆凯源石油天然气有限责任公司": "Chongqing Kaiyuan Petroleum and Natural Gas Co Co., Ltd.",
  "河北星充新能源科技有限公司": "Hebei Xingchong New Energy Technology Co Co., Ltd.",
  "石家庄福佑建筑工程有限公司": "Shijiazhuang Fuyou Construction Engineering Co Co., Ltd.",
  "宁夏坤达物流有限公司": "Ningxia Kunda Logistics Co Co., Ltd.",
  "攀枝花市傲佳新能源有限公司": "Panzhihua Aojia New Energy Co Co., Ltd.",
  "阜阳途盛新能源有限公司": "Fuyang Tusheng New Energy Co Co., Ltd.",
  "梅州佳朋新能源科技有限公司": "Meizhou Jiapeng New Energy Technology Co Co., Ltd.",
  "山西山安安装工程有限公司": "Shanxi Shan'an Installation Engineering Co Co., Ltd.",
  "赵县博源新能源有限公司": "Zhaoxian Boyuan New Energy Co Co., Ltd.",
  "普洱欣汇新能源有限公司": "Pu'er Xinhui New Energy Co Co., Ltd.",
  "蠡县润泽顺新能源科技有限公司": "Lixian Runzeshun New Energy Technology Co Co., Ltd.",
  "宁夏坤达物流有限公司庆阳分公司": "Ningxia Kunda Logistics Co., . Qingyang Branch Co., Ltd.",
  "北京绿城未来新能源汽车有限公司": "Beijing Greentown Future New Energy Vehicle Co Co., Ltd.",
  "石家庄市灿烨科技有限公司": "Shijiazhuang Canye Technology Co Co., Ltd.",
  "辉县市宏图汽贸有限公司": "Huixian City Hongtu Auto Trade Co Co., Ltd.",
  "成都华瑾长枫科技有限公司": "Chengdu Huajin Changfeng Technology Co Co., Ltd.",
  "河北宝能新能源科技有限公司": "Hebei Baoneng New Energy Technology Co Co., Ltd.",
  "四川天辰物流有限公司": "Sichuan Tianchen Logistics Co Co., Ltd.",
  "河北新金钢铁有限公司": "Hebei Xinjin Iron and Steel Co Co., Ltd.",
  "宁晋县盛汇科技有限公司": "Ningjin Shenghui Technology Co Co., Ltd.",
  "亭卫": "Tingwei",
  "星星亭卫": "StarCharge + Tingwei",
  "石家庄魏通新能源科技有限公司": "Shijiazhuang Weitong New Energy Technology Co Co., Ltd.",
  "运城市盐湖区金井乡南扶飞龙充电站": "Nanfu Feilong Charging Station, Jinjing Township, Yanhu District, Yuncheng City",
  "河北跃润电力工程有限公司": "Hebei Yuerun Electric Power Engineering Co Co., Ltd.",
  "隆尧县菅村福星商贸经营部": "Longyao County Sugamura Fuxing Commerce and Trade Department",
  "山西茂鑫嘉科技有限公司": "Shanxi Maoxinjia Technology Co Co., Ltd.",
  "泉州市领启新能源科技有限公司": "Quanzhou Lingqi New Energy Technology Co Co., Ltd.",
  "云南聚睿新能源科技有限公司": "Yunnan Jurui New Energy Technology Co Co., Ltd.",
  "永城市鑫路新能源经营部（个人独资）": "Yongcheng Xinlu New Energy Management Department (solo Proprietorship)",
  "莆田顶优新能源科技有限公司": "Putian Dingyou New Energy Technology Co Co., Ltd.",
  "高平国投智慧出行科技有限公司": "Gaoping Guotou Smart Travel Technology Co Co., Ltd.",
  "陕西北角中界贸易有限公司": "Shaanxi North Point Zhongjie Trading Co Co., Ltd.",
  "深圳市旺利来电力有限公司": "Shenzhen Wanglilai Electric Power Co Co., Ltd.",
  "石家庄宏之宝机动车检测有限公司": "Shijiazhuang Hongzhibao Motor Vehicle Inspection Co Co., Ltd.",
  "新平金鼎上门有限公司": "Xinping Jinding Door Co Co., Ltd.",
  "邯郸市鑫灿新能源科技有限公司": "Handan Xincan New Energy Technology Co Co., Ltd.",
  "攀枝花驷美兴供应链有限公司": "Panzhihua Simeixing Supply Chain Co Co., Ltd.",
  "乌海海易通银隆新能源汽车有限公司": "Wuhai Haiyitong Yinlong New Energy Vehicle Co Co., Ltd.",
  "晋中市太谷经济技术开发区源盛新能源有限公司": "Jinzhongshitaigujingjijishukaifaquyuanshengxinnengyuanyouxiangongsi Co., Ltd.",
  "山西途畅新能源服务有限公司": "Shanxi Tuchang New Energy Service Co Co., Ltd.",
  "深圳市中基电新能源科技有限公司": "Shenzhen Zhongjidian New Energy Technology Co Co., Ltd.",
  "寅元特": "Yin Yuante",
  "星星寅元特": "StarCharge + Yin Yuante",
  "济南市莱芜昊通物流有限公司": "Jinan Laiwu Haotong Logistics Co Co., Ltd.",
  "重庆星充新能源科技有限公司": "Chongqing Xingchong New Energy Technology Co Co., Ltd.",
  "安阳志科供应链管理有限公司": "Anyang Zhike Supply Chain Management Co Co., Ltd.",
  "郑州立志新能源有限公司": "Zhengzhou Lizhi New Energy Co Co., Ltd.",
  "唐山港陆钢铁有限公司": "Tangshan Ganglu Steel Co Co., Ltd.",
  "新兴铸管集团武安铭泰物流有限公司": "Xinxing Pipe Casting Group Wu'an Mingtai Logistics Co Co., Ltd.",
  "朔州市合聚道路运输有限公司": "Shuozhou Heju Road Transport Co Co., Ltd.",
  "昆明向前冲新能源有限责任公司": "Kunming Xiangqianchong New Energy Co Co., Ltd.",
  "晋城红海洋绿铁易行新能源充电有限公司": "Jincheng Red Ocean Green Iron Yixing New Energy Charging Co Co., Ltd.",
  "沁水县瑞通商贸有限公司": "Qinshui County Ruitong Trading Co Co., Ltd.",
  "山西沃能化工科技有限公司": "Shanxi Woneng Chemical Technology Co Co., Ltd.",
  "淇县乐祥充电科技有限公司": "Qixian Lexiang Charging Technology Co Co., Ltd.",
  "河南新一代绿能运输有限公司": "Henan New Generation Green Energy Transportation Co Co., Ltd.",
  "曲沃县飞达智能充电站有限公司": "Quwo County Feida Intelligent Charging Station Co Co., Ltd.",
  "攀枝花瑞尔森新能源有限公司": "Panzhihua Ruierson New Energy Co Co., Ltd.",
  "洪洞县海鑫新能源有限公司": "Hongdong County Haixin New Energy Co Co., Ltd.",
  "紫金铜业有限公司紫金铜业酒店": "Zijin Copper Industry Co., . Zijin Copper Industry Hotel Co., Ltd.",
  "万宁嘉德兴盛建材有限责任公司": "Wanning Jiade Xingsheng Building Materials Co Co., Ltd.",
  "红河红发新基建投资运营有限公司": "Honghe Hongfa New Infrastructure Investment and Operation Co Co., Ltd.",
  "山西顺捷三力新能源有限责任公司": "Shanxi Shunjie Sanli New Energy Co Co., Ltd.",
  "文水晋圣博新能源科技有限公司": "Wenshui Jinshengbo New Energy Technology Co Co., Ltd.",
  "石家庄中博电力工程有限公司无极分公司": "Shijiazhuang Zhongbo Electric Power Engineering Co., . Wuji Branch Co., Ltd.",
  "乌苏市苏博新能源汽车充电服务有限公司": "Wusu Subo New Energy Vehicle Charging Service Co Co., Ltd.",
  "四川锦熹硕果新能源科技有限公司": "Sichuan Jinxi Shuoguo New Energy Technology Co Co., Ltd.",
  "河北宝华房地产开发有限公司": "Hebei Baohua Real Estate Development Co Co., Ltd.",
  "漳州厚境新能源科技有限公司": "Zhangzhou Houjing New Energy Technology Co Co., Ltd.",
  "高平市岚泰物贸有限公司": "Gaoping Lantai Materials Trade Co Co., Ltd.",
  "数据线惠奥文化传播处": "Data Line Huiao Culture Communication Office",
  "丹凤县恒德瑞便民新能源科技有限公司": "Danfeng County Hengderui Convenience New Energy Technology Co Co., Ltd.",
  "海口市公共充电投资运营有限公司": "Haikou Public Charging Investment and Operation Co Co., Ltd.",
  "保定铁诺货物运输有限公司": "Baoding Tienuo Cargo Transport Co Co., Ltd.",
  "长沙星充新能源科技有限公司": "Changsha Xingchong New Energy Technology Co Co., Ltd.",
  "石家庄亚隆市政工程有限公司": "Shijiazhuang Yalong Municipal Engineering Co Co., Ltd.",
  "惠来县福群新能源科技有限公司": "Huilai County Fuqun New Energy Technology Co Co., Ltd.",
  "云南来充电科技有限公司": "Yunnan Lai Charging Technology Co Co., Ltd.",
  "南港码头": "Nangang Pier",
  "重庆渝途物流科技有限公司": "Chongqing Yutu Logistics Technology Co Co., Ltd.",
  "泉州和众兴新能源科技有限公司": "Quanzhou Hezhongxing New Energy Technology Co Co., Ltd.",
  "云南臻锋物流有限公司": "Yunnan Zhenfeng Logistics Co Co., Ltd.",
  "临汾市尧都区裕之星充电有限公司": "Linfen Yaodu District Yuzhixing Charging Co Co., Ltd.",
  "福建海峡创新数字科技有限公司": "Fujian Strait Innovation Digital Technology Co Co., Ltd.",
  "四川电宝宝科技有限公司": "Sichuan Electric Baby Technology Co Co., Ltd.",
  "内蒙古蒙泰集团有限公司": "Inner Mongolia Mengtai Group Co Co., Ltd.",
  "夹江鑫宏茂新能源科技有限公司": "Jiajiang Xin Hongmao New Energy Technology Co Co., Ltd.",
  "石家庄祥益汽车服务有限公司": "Shijiazhuang Xiangyi Automobile Service Co Co., Ltd.",
  "四川德隆川电新能源科技有限公司": "Sichuan Delong Chuandian New Energy Technology Co Co., Ltd.",
  "长治市宏域新能源有限公司": "Changzhi Hongyu New Energy Co Co., Ltd.",
  "上海易欣缘新能源科技有限公司": "Shanghai Yixinyuan New Energy Technology Co Co., Ltd.",
  "临颍县日进售电有限公司": "Linying County Rijin Electric Power Sales Co Co., Ltd.",
  "迁安市尚博商贸有限公司": "Qian'an Shangbo Trading Co Co., Ltd.",
  "驻马店千里行新能源汽车销售有限公司": "Zhumadian Qianlixing New Energy Vehicle Sales Co Co., Ltd.",
  "河北富悦新能源科技有限公司": "Hebei Fuyue New Energy Technology Co Co., Ltd.",
  "漳州市合发新能源科技有限公司": "Zhangzhou Hefa New Energy Technology Co Co., Ltd.",
  "泉州浩源润滑油有限责任公司": "Quanzhou Haoyuan Lubricating Oil Co Co., Ltd.",
  "深圳市粤达新能源科技有限公司": "Shenzhen Yueda New Energy Technology Co Co., Ltd.",
  "西双版纳绿途充电桩有限公司": "Xishuangbanna Lutu Charging Pile Co Co., Ltd.",
  "漳州市冠捷物流有限公司": "Zhangzhou Guanjie Logistics Co Co., Ltd.",
  "云南社灵司经贸有限公司": "Yunnan Shelingsi Economic and Trade Co Co., Ltd.",
  "望都县创能集中式快速充电站（个人独资）": "Wangdu County Chuangneng Centralized Fast Charging Station (solo Proprietorship)",
  "山西德施普能源有限公司": "Shanxi Desip Energy Co Co., Ltd.",
  "安驰集中式快速充电站（温县）有限公司": "Anchi Centralized Fast Charging Station (wenxian) Co Co., Ltd.",
  "陕西渭南天晴电气有限公司": "Shaanxi Weinan Tianqing Electric Co Co., Ltd.",
  "河南空港鑫达新能源科技有限公司": "Henan Airport Xinda New Energy Technology Co Co., Ltd.",
  "天津市鑫骏捷新能源科技有限公司": "Tianjin Xinjunjie New Energy Technology Co Co., Ltd.",
  "邯郸市广丰物流有限公司": "Handan Guangfeng Logistics Co Co., Ltd.",
  "河北金彦新能源有限公司": "Hebei Jinyan New Energy Co Co., Ltd.",
  "河南皓格新能源科技有限公司": "Henan Haoge New Energy Technology Co Co., Ltd.",
  "邯郸市恒进物流有限公司": "Handan Hengjin Logistics Co Co., Ltd.",
  "深圳石龙建筑工程有限公司": "Shenzhen Shilong Construction Engineering Co Co., Ltd.",
  "郑州启华渣士清运有限公司": "Zhengzhou Qihua Zhashi Cleaning Co Co., Ltd.",
  "海南富山新能源项目管理有限公司": "Hainan Fushan New Energy Project Management Co Co., Ltd.",
  "保定万丰新能源科技有限公司": "Baoding Wanfeng New Energy Technology Co Co., Ltd.",
  "亿祥隆（唐山）新能源科技有限公司": "Yixianglong (tangshan) New Energy Technology Co Co., Ltd.",
  "禹州市坤亿集中式快速充电站有限公司": "Yuzhou Kunyi Centralized Fast Charging Station Co Co., Ltd.",
  "重卡可充": "Heavy Truck Rechargeable",
  "高速口200KW": "High Speed Opening 200kw",
  "上海邦品物业管理有限公司": "Shanghai Bangpin Property Management Co Co., Ltd.",
  "云鲲鹏（上海）新能源有限公司": "Yunkunpeng (shanghai) New Energy Co Co., Ltd.",
  "晋中明胜汽车运输有限公司": "Jinzhong Mingsheng Automobile Transport Co Co., Ltd.",
  "忻州市长兴新能源科技有限公司": "Xinzhou Changxing New Energy Technology Co Co., Ltd.",
  "勐腊磊鑫机械设备租赁部": "Mengla Leixin Machinery Equipment Leasing Department",
  "巩义市新卓越运输有限公司": "Gongyi Xinzhuo Transportation Co Co., Ltd.",
  "云南江开新能源科技有限公司": "Yunnan Jiangkai New Energy Technology Co Co., Ltd.",
  "阳城县翔宏出租汽车有限公司": "Yangcheng County Xianghong Taxi Co Co., Ltd.",
  "阳泉市星星长岭新能源有限公司": "Yangquan Xingxing Changling New Energy Co Co., Ltd.",
  "长治市星辉新能源科技有限公司": "Changzhi Xinghui New Energy Technology Co Co., Ltd.",
  "寿阳县神山建筑工程有限公司": "Shouyang Shenshan Construction Engineering Co Co., Ltd.",
  "大客货兼容": "Large Passenger and Cargo Compatible",
  "沁源县恒瑞新能源有限公司": "Qinyuan County Hengrui New Energy Co Co., Ltd.",
  "四川宏盛智慧新能源有限公司": "Sichuan Hongsheng Smart New Energy Co Co., Ltd.",
  "四川亿速电新能源科技有限公司": "Sichuan Yisudian New Energy Technology Co Co., Ltd.",
  "长治市屯留区祥和新能源有限公司": "Changzhi Tunliu District Xianghe New Energy Co Co., Ltd.",
  "可充大巴车牵引车": "Rechargeable Bus Tractor",
  "迁西县贵民汽车销售有限公司": "Qianxi County Guimin Automobile Sales Co Co., Ltd.",
  "临县晋陕机动车充电服务有限公司": "Linxian Jinshan Motor Vehicle Charging Service Co Co., Ltd.",
  "石家庄万营新能源科技有限公司": "Shijiazhuang Wanying New Energy Technology Co Co., Ltd.",
  "霍州市辛置公交客运有限公司": "Huozhou Xinzhi Bus Passenger Transport Co Co., Ltd.",
  "重庆柯泰文汽车维修有限公司": "Chongqing Ketaiwen Automobile Maintenance Co Co., Ltd.",
  "禹州市禹电新能源科技有限公司": "Yuzhou Yudian New Energy Technology Co Co., Ltd.",
  "山西宝汇能源科技有限公司": "Shanxi Baohui Energy Technology Co Co., Ltd.",
  "晋中一丁劳务服务有限公司": "Jinzhong Yiding Labor Service Co Co., Ltd.",
  "郑州鸿晟新能源有限公司": "Zhengzhou Hongsheng New Energy Co Co., Ltd.",
  "吕梁市智鑫新能源科技有限公司": "Luliang Zhixin New Energy Technology Co Co., Ltd.",
  "惠州市碧富缘能源管理有限公司": "Huizhou Bifuyuan Energy Management Co Co., Ltd.",
  "上海虹梅通新能源有限公司": "Shanghai Hongmeitong New Energy Co Co., Ltd.",
  "可克达拉市汇金投资有限责任公司": "Kekedala Huijin Investment Co Co., Ltd.",
  "井陉县金亿圆加油站": "Jingxing County Jinyiyuan Gas Station",
  "行唐县龙昌客运站有限公司": "Xingtang County Longchang Passenger Transport Station Co Co., Ltd.",
  "辉县市常春新能源有限公司": "Huixian Changchun New Energy Co Co., Ltd.",
  "长治市万鼎工贸有限公司": "Changzhi Wanding Industry and Trade Co Co., Ltd.",
  "长治市财农新能源有限公司": "Changzhi Cainong New Energy Co Co., Ltd.",
  "涿州市宏利物资贸易有限公司": "Zhuozhou Hongli Materials Trading Co Co., Ltd.",
  "孝义东通物流仓储有限公司": "Xiaoyi Dongtong Logistics and Warehousing Co Co., Ltd.",
  "成都市泰瀚新能源科技有限公司": "Chengdu Taihan New Energy Technology Co Co., Ltd.",
  "山西士博新能源有限公司": "Shanxi Shibo New Energy Co Co., Ltd.",
  "四川星宇绿能科技有限公司": "Sichuan Xingyu Green Energy Technology Co Co., Ltd.",
  "秦皇岛聚欣亨发新能源有限公司": "Qinhuangdao Juxinhengfa New Energy Co Co., Ltd.",
  "四川省水电集团大竹电力有限公司": "Sichuan Hydropower Group Dazhu Electric Power Co Co., Ltd.",
  "惠州市宇顺新能源科技有限公司": "Huizhou Yushun New Energy Technology Co Co., Ltd.",
  "静乐县景顺来新能源发展有限公司": "Jingle County Inveshu Lai New Energy Development Co Co., Ltd.",
  "山西安泰物流股份有限公司": "Shanxi Antai Logistics Co Co., Ltd.",
  "宜宾鼎戎建筑劳务有限公司": "Yibin Dingrong Construction Labor Co Co., Ltd.",
  "晋江波仕卡新能源有限公司": "Jinjiang Boshika New Energy Co Co., Ltd.",
  "山西万豪建材有限公司": "Shanxi Marriott Building Materials Co Co., Ltd.",
  "揭阳市永升装饰工程有限公司": "Jieyang Yongsheng Decoration Engineering Co Co., Ltd.",
  "山东永达物流有限公司": "Shandong Yongda Logistics Co Co., Ltd.",
  "唐山星充新能源科技有限公司": "Tangshan Xingchong New Energy Technology Co Co., Ltd.",
  "山西天恒氢能科技有限公司": "Shanxi Tianheng Hydrogen Energy Technology Co Co., Ltd.",
  "泉州市全达充电科技有限公司": "Quanzhou Quanda Charging Technology Co Co., Ltd.",
  "山西鼎辉极电新能源科技有限公司": "Shanxi Dinghui Jidian New Energy Technology Co Co., Ltd.",
  "宁夏睿禾工贸有限公司": "Ningxia Ruihe Industry and Trade Co Co., Ltd.",
  "芒市苗苗充电桩站(个人独资)": "Miaomiao Charging Pile Station (solo Proprietorship)",
  "四川欣永汇新能源科技有限公司": "Sichuan Xinyonghui New Energy Technology Co Co., Ltd.",
  "攀枝花新高帆科技有限公司": "Panzhihua Xingaofan Technology Co Co., Ltd.",
  "河北龙锦建材有限公司": "Hebei Longjin Building Materials Co Co., Ltd.",
  "大型车可充": "Large Car Rechargeable",
  "长治昌顺洗煤有限公司": "Changzhi Changshun Coal Washing Co Co., Ltd.",
  "宁洱万达物流有限公司": "Ning'er Wanda Logistics Co Co., Ltd.",
  "建水县晟阳新能源科技有限公司": "Jianshui County Shengyang New Energy Technology Co Co., Ltd.",
  "成都超山新能源科技有限公司": "Chengdu Chaoshan New Energy Technology Co Co., Ltd.",
  "祁县东兆新能源有限公司": "Qixian Dongzhao New Energy Co Co., Ltd.",
  "新国线集团（来宾）运输有限公司": "Xinguo Line Group (laibin) Transportation Co Co., Ltd.",
  "驰云涧": "Chi Yunjian",
  "星星驰云涧": "StarCharge + Chi Yunjian",
  "濮阳市星程新能源科技公司": "Puyang Xingcheng New Energy Technology Co Co., Ltd.",
  "定州嘉信新能源科技有限公司": "Dingzhou Jiaxin New Energy Technology Co Co., Ltd.",
  "宁夏腾越新能源科技有限公司": "Ningxia Tengyue New Energy Technology Co Co., Ltd.",
  "贵州中恒物流有限公司": "Guizhou Zhongheng Logistics Co Co., Ltd.",
  "云南玉溪福鑫物流贸易有限公司": "Yunnan Yuxi Fuxin Logistics Trading Co Co., Ltd.",
  "广东宏益新能源有限公司": "Guangdong Hongyi New Energy Co Co., Ltd.",
  "汕头市东泓能源科技有限公司": "Shantou Donghong Energy Technology Co Co., Ltd.",
  "乐亭县旺银物流有限公司": "Leting County Wangyin Logistics Co Co., Ltd.",
  "山西晋海鑫新能源科技有限公司": "Shanxi Jinhaixin New Energy Technology Co Co., Ltd.",
  "上海有点勤劳新能源科技有限公司": "Shanghai Lanqinluo New Energy Technology Co Co., Ltd.",
  "石家庄时运土石方工程有限公司": "Shijiazhuang Shiyun Earthwork Engineering Co Co., Ltd.",
  "成都鑫泽时代新能源科技有限公司": "Chengdu Xinze Times New Energy Technology Co Co., Ltd.",
  "平乡县存友新能源科技有限公司": "Pingxiang County Cunyou New Energy Technology Co Co., Ltd.",
  "山西沣能绿电科技服务有限公司": "Shanxi Fengneng Green Electric Technology Service Co Co., Ltd.",
  "山西鼎泰恒安新能源科技有限公司": "Shanxi Dingtai Hengan New Energy Technology Co Co., Ltd.",
  "唐山市双赢物流有限公司": "Tangshan Shuangying Logistics Co Co., Ltd.",
  "灵寿县车友机动车充电站": "Lingshou County Car Friend Motor Vehicle Charging Station",
  "珙县荣聚新能源汽车有限公司": "Gongxian Rongju New Energy Vehicle Co Co., Ltd.",
  "乡宁县隆鑫达新能源有限公司": "Xiangning County Longxinda New Energy Co Co., Ltd.",
  "深圳市恒辉腾新能源有限公司": "Shenzhen Henghuiteng New Energy Co Co., Ltd.",
  "龙岩城发城市服务集团有限公司": "Longyan Chengfa City Service Group Co Co., Ltd.",
  "施家站": "Shijia Station",
  "屯留县鑫泽洗煤有限公司": "Tunliu County Xinze Coal Washing Co Co., Ltd.",
  "湖南健能新能源有限公司": "Hunan Jianneng New Energy Co Co., Ltd.",
  "超充": "Super Charge",
  "郑州市上街区运输公司": "Zhengzhou Shangjie District Transportation Co., Ltd.",
  "惠来宏建新能源有限公司": "Huilai Hongjian New Energy Co Co., Ltd.",
  "邢台天泉商品混凝土有限责任公司": "Xingtai Tianquan Commodity Concrete Co Co., Ltd.",
  "孝义市网红商贸有限公司": "Xiaoyi Internet Celebrity Trading Co Co., Ltd.",
  "河北岚间运输有限公司": "Hebei Lanjian Transportation Co Co., Ltd.",
  "唐县正隆加油站": "Tang County Zhenglong Gas Station",
  "海南博程物流有限责任公司": "Hainan Bocheng Logistics Co Co., Ltd.",
  "上海筠停信息科技有限公司": "Shanghai Yunting Information Technology Co Co., Ltd.",
  "甘肃朝阳电力工程有限责任公司": "Gansu Chaoyang Electric Power Engineering Co Co., Ltd.",
  "天津全胜嘉鸿新能源科技发展有限公司": "Tianjin Quansheng Jiahong New Energy Technology Development Co Co., Ltd.",
  "山西泰华源新能源科技有限公司": "Shanxi Taihuayuan New Energy Technology Co Co., Ltd.",
  "平山县泽鑫汽车服务有限公司": "Pingshan County Zexin Automobile Service Co Co., Ltd.",
  "寿阳县铭瑞新能源有限公司": "Shouyang County Mingrui New Energy Co Co., Ltd.",
  "云南千驰能源科技有限公司": "Yunnan Qianchi Energy Technology Co Co., Ltd.",
  "南安市啊滨石业有限公司": "Nan'an Abin Stone Industry Co Co., Ltd.",
  "丰顺县俊鹏贸易有限公司": "Fengshun County Junpeng Trading Co Co., Ltd.",
  "重卡可用": "Heavy Trucks Are Available",
  "云南永充新能源科技有限公司": "Yunnan Yongchong New Energy Technology Co Co., Ltd.",
  "常州市永光车业有限公司": "Changzhou Yongguang Vehicle Industry Co Co., Ltd.",
  "上海莲之嘉新能源科技有限公司": "Shanghai Lianzhijia New Energy Technology Co Co., Ltd.",
  "福州东方青雷科技有限公司": "Fuzhou Oriental Qinglei Technology Co Co., Ltd.",
  "万帮之星科技（海南）有限公司": "Wanbang Star Technology (hainan) Co Co., Ltd.",
  "河津市晋惠钙业有限公司": "Hejin Jinhui Calcium Industry Co Co., Ltd.",
  "漳州市连顺新能源科技有限公司": "Zhangzhou Lianshun New Energy Technology Co Co., Ltd.",
  "滑县金晟新能源有限公司": "Huaxian Jinsheng New Energy Co Co., Ltd.",
  "忻州市忻三新能源有限公司": "Xinzhou Xinsan New Energy Co Co., Ltd.",
  "无极限明辉新能源科技有限公司": "Wuji Minghui New Energy Technology Co Co., Ltd.",
  "劲立得（河南）新能源有限公司": "Jinlide (henan) New Energy Co Co., Ltd.",
  "济南市莱芜区众联钢材库": "Zhonglian Steel Library, Laiwu District, Jinan City",
  "汕头市冠波新能源科技有限公司": "Shantou Guanbo New Energy Technology Co Co., Ltd.",
  "镇宁自治县玉华汽车运输有限责任公司": "Zhenning Autonomous County Yuhua Automobile Transport Co Co., Ltd.",
  "云南驰通物流有限公司": "Yunnan Chitong Logistics Co Co., Ltd.",
  "河南胜祥新能源汽车租赁有限公司": "Henan Shengxiang New Energy Vehicle Rental Co Co., Ltd.",
  "简阳市大金众鑫汽车服务有限公司": "Jianyang Dajin Zhongxin Automobile Service Co Co., Ltd.",
  "深圳市屹得物业管理有限公司": "Shenzhen Yide Property Management Co Co., Ltd.",
  "习水县绿洲公共交通有限责任公司": "Xishui County Oasis Public Transport Co Co., Ltd.",
  "石家庄慧豪新能源科技有限公司": "Shijiazhuang Huihao New Energy Technology Co Co., Ltd.",
  "郑州正创新能源有限公司": "Zhengzhou Zheng Innovation Energy Co Co., Ltd., New Energy",
  "攀枝花市志豪物流有限责任公司": "Panzhihua Zhihao Logistics Co Co., Ltd.",
  "海口市公交场站投资建设有限公司": "Haikou Bus Station Investment and Construction Co Co., Ltd.",
  "腾顺（福建）危险货物运输有限公司": "Tengshun (fujian) Dangerous Goods Transport Co Co., Ltd.",
  "石家庄富砼建材有限公司": "Shijiazhuang Fu Concrete Building Materials Co Co., Ltd.",
  "河北邵联商品混凝土有限公司": "Hebei Shaolian Commodity Concrete Co Co., Ltd.",
  "四川臻福物流有限公司": "Sichuan Zhenfu Logistics Co Co., Ltd.",
  "巩义市沣达新能源科技有限公司": "Gongyi Fengda New Energy Technology Co Co., Ltd.",
  "太谷县南郭村程江饭店": "Chengjiang Hotel, Nanguo Village, Taigu County",
  "河南全能领航新能源有限公司": "Henan All-Neng Navigation New Energy Co Co., Ltd.",
  "重庆保泰充电科技服务有限公司": "Chongqing Baotai Charging Technology Service Co Co., Ltd.",
  "山西隆兴新能源有限公司": "Shanxi Longxing New Energy Co Co., Ltd.",
  "河北义和能源管理有限公司": "Hebei Yihe Energy Management Co Co., Ltd.",
  "沙河市硕茂集中式快速充电站有限公司": "Shahe Shuomao Centralized Fast Charging Station Co Co., Ltd.",
  "禹州市禹盛新能源中心（个体工商户）": "Yuzhoushiyushengxinnengyuanzhongxin（getigongshanghu）, New Energy",
  "瞻星": "Zhanxing",
  "山西万和盛新能源科技有限公司": "Shanxi Wanhesheng New Energy Technology Co Co., Ltd.",
  "沈北新区天王街": "Tianwang Street, Shenbei New District",
  "喀什京盛鑫工程机械有限公司": "Kashgar Jingshengxin Engineering Machinery Co Co., Ltd.",
  "太谷县恒信汽贸有限公司": "Taigu County Hengxin Auto Trade Co Co., Ltd.",
  "深泽县易充达集中式快速充电站有限公司": "Shenze County Yichangda Centralized Fast Charging Station Co Co., Ltd.",
  "长治市垩煜工贸有限公司": "Changzhi Heiyu Industry and Trade Co Co., Ltd.",
  "漳州市天选网络科技有限公司": "Zhangzhou Tianxuan Network Technology Co Co., Ltd.",
  "瞻星新能源科技（上海）有限公司": "Zhanxing New Energy Technology (shanghai) Co Co., Ltd.",
  "海南捷顺荣实业有限公司": "Hainan Jieshunrong Industrial Co Co., Ltd.",
  "山西电驰新能源科技有限公司": "Shanxi Dianchi New Energy Technology Co Co., Ltd.",
  "唐山市荣辉货物运输有限公司": "Tangshan Ronghui Cargo Transport Co Co., Ltd.",
  "杭州建德经开新能源有限公司": "Hangzhou Jiande Economic Development New Energy Co Co., Ltd.",
  "唐山海港荣盛运输服务有限公司": "Tangshan Haigang Rongsheng Transportation Service Co Co., Ltd.",
  "河南宏风新能源科技有限责任公司": "Henan Hongfeng New Energy Technology Co Co., Ltd.",
  "内蒙古盛航新能源科技有限公司": "Inner Mongolia Shenghang New Energy Technology Co Co., Ltd.",
  "西双版纳纳景源光能科技有限公司": "Xishuangbanna Na Jingyuan Optical Energy Technology Co Co., Ltd.",
  "郴州金伟光伏电力有限公司": "Chenzhou Jinwei Photovoltaic Power Co Co., Ltd.",
  "莒南县记山全羊馆（个体工商户）": "Jishan Quanyang Pavilion in Junan County (individual Business Owner)",
  "河南万帮充电设备有限公司": "Henan Wanbang Charging Equipment Co Co., Ltd.",
  "临汾市鹏安达新能源有限公司": "Linfen Penganda New Energy Co Co., Ltd.",
  "成都星垚新能源科技有限责任公司": "Chengdu Xingyao New Energy Technology Co Co., Ltd.",
  "山西东之和建筑服务有限公司孙乔分公司": "Sun Qiao Branch of Shanxi Dongzhihe Construction Service Co Co., Ltd.",
  "原平市龙达新能源有限公司": "Yuanping Longda New Energy Co Co., Ltd.",
  "河曲县青诚新能源科技有限公司": "Hequ County Qingcheng New Energy Technology Co Co., Ltd.",
  "忻州市忻府区金山仓储物流园（个体工商户）": "Xinzhoushixinfuqujinshancangchuwuliuyuan（getigongshanghu）",
  "山西金鹏绿色能源发展有限公司": "Shanxi Jinpeng Green Energy Development Co Co., Ltd.",
  "海南润鑫科技投资有限公司": "Hainan Runxin Technology Investment Co Co., Ltd.",
  "成都星充新能源科技有限公司": "Chengdu Xingchong New Energy Technology Co Co., Ltd.",
  "临汾市泰鑫怡物流服务有限公司": "Linfen Taixinyi Logistics Service Co Co., Ltd.",
  "武乡县畅达新能源有限公司": "Wuxiang County Changda New Energy Co Co., Ltd.",
  "黔西正萍贸易有限公司": "Qianxi Zhengping Trading Co Co., Ltd.",
  "临汾市尧运生建材股份有限公司": "Linfen Yaoyunsheng Building Materials Co Co., Ltd.",
  "四川成翰托运新能源科技有限公司": "Sichuan Chenghan Consignment New Energy Technology Co Co., Ltd.",
  "唐山瀚霄新能源科技有限公司": "Tangshan Hanxiao New Energy Technology Co Co., Ltd.",
  "成都恒源渝新能源科技有限公司": "Chengdu Hengyuanyu New Energy Technology Co Co., Ltd.",
  "汝州市欣祥仓储有限公司": "Ruzhou Xinxiang Warehousing Co Co., Ltd.",
  "河北金盈土石方工程有限公司": "Hebei Jinying Earthwork Engineering Co Co., Ltd.",
  "86号煤场旁": "Next to Coal Farm No. 86",
  "山西兴德昌能源有限公司": "Shanxi Xingdechang Energy Co Co., Ltd.",
  "山西远迅能源有限公司": "Shanxi Yuanxun Energy Co Co., Ltd.",
  "乐亭焱瑶氢电新能源科技有限公司": "Leting Yanyao Hydrogen Electric New Energy Technology Co Co., Ltd.",
  "新乡君乐充电新能源科技有限公司": "Xinxiang Junle Charging New Energy Technology Co Co., Ltd.",
  "华能安阳热电有限责任公司": "Huaneng Anyang Thermal Power Co Co., Ltd.",
  "湖南省宝通新能源有限责任公司": "Hunan Baotong New Energy Co Co., Ltd.",
  "鑫星": "Xinxing",
  "星星鑫星": "StarCharge + Xinxing",
  "泉州市交发能源科技有限公司": "Quanzhou Jiaofa Energy Technology Co Co., Ltd.",
  "中石油新疆销售有限公司塔城分公司": "Tacheng Branch of Cnpc Xinjiang Sales Co Co., Ltd.",
  "万帮星星充电科技有限公司": "Wanbang Xingxing Charging Technology Co Co., Ltd.",
  "邯郸市聚福物流有限公司": "Handan Jufu Logistics Co Co., Ltd.",
  "兴吉（仙游）投资有限公司": "Xingji (xianyou) Investment Co Co., Ltd.",
  "邢台市开发区秦维新能源科技有限公司": "Xingtai Development Zone Qinwei New Energy Technology Co Co., Ltd.",
  "安阳创建商贸有限公司": "Anyang Creation Trading Co Co., Ltd.",
  "山西星星数字能源有限公司": "Shanxi Xingxing Digital Energy Co Co., Ltd.",
  "上海点充信息科技有限公司": "Shanghai Dianchong Information Technology Co Co., Ltd.",
  "邯郸开发区通茂商品混凝土有限公司": "Handan Development Zone Tongmao Commercial Concrete Co Co., Ltd.",
  "上海飒得新能源科技有限公司": "Shanghai Sade New Energy Technology Co Co., Ltd.",
  "济南星充新能源有限公司": "Jinan Xingchong New Energy Co Co., Ltd.",
  "磁县辉宇集中式快速充电站有限公司": "Cixian Huiyu Centralized Fast Charging Station Co Co., Ltd.",
  "郑州满仓实业有限公司": "Zhengzhou Mancang Industrial Co Co., Ltd.",
  "山西熙烨新能源有限公司": "Shanxi Xiye New Energy Co Co., Ltd.",
  "深圳市浩欣新能源科技有限公司": "Shenzhen Haoxin New Energy Technology Co Co., Ltd.",
  "广东奔业新能源有限公司": "Guangdong Benye New Energy Co Co., Ltd.",
  "四川云晟见日新能源有限公司": "Sichuan Yunsheng Jianri New Energy Co Co., Ltd.",
  "海南乐东沿海纯电动汽车服务有限责任公司": "Hainan Ledong Coastal Pure Electric Vehicle Service Co Co., Ltd.",
  "张家界和欣新能源科技有限公司": "Zhangjiajie Hexin New Energy Technology Co Co., Ltd.",
  "内蒙古荣通数链煤炭科技有限公司": "Inner Mongolia Rongtong Digital Chain Coal Technology Co Co., Ltd.",
  "安泽百盛新能源有限公司": "Anze Parkson New Energy Co Co., Ltd.",
  "贵州犇富新能源科技发展有限公司": "Guizhou Benfu New Energy Technology Development Co Co., Ltd.",
  "石家庄鹿泉区曼德汽车服务有限公司": "Shijiazhuang Luquan District Mande Automobile Service Co Co., Ltd.",
  "新绛县锦海运输股份有限公司": "Xinxiang County Jinhai Transportation Co Co., Ltd.",
  "上海易慧智能停车管理有限公司": "Shanghai Yihui Intelligent Parking Management Co Co., Ltd.",
  "交口县新艺新能源充电站（个人独资）": "Jiaokou County Xinyi New Energy Charging Station (solo Proprietorship)",
  "柳林县泰达洗煤有限责任公司": "Liulin County Teda Coal Washing Co Co., Ltd.",
  "天津市新华物流服务有限公司": "Tianjin Xinhua Logistics Service Co Co., Ltd.",
  "上海百嘉盛新能源科技有限公司": "Shanghai Baijiasheng New Energy Technology Co Co., Ltd.",
  "深圳市顺生汇实业发展有限公司": "Shenzhen Shunshenghui Industrial Development Co Co., Ltd.",
  "山西星源达物流有限公司": "Shanxi Xingyuanda Logistics Co Co., Ltd.",
  "上海秀璐新能源汽车服务有限公司": "Shanghai Xiulu New Energy Vehicle Service Co Co., Ltd.",
  "云南建投绿色发展有限公司": "Yunnan Jiantou Green Development Co Co., Ltd.",
  "禹州市合祥汽车销售服务有限公司": "Yuzhou Hexiang Automobile Sales Service Co Co., Ltd.",
  "可充大巴": "Rechargeable Bus",
  "澳技新能源科技（上海）有限公司": "Aoji New Energy Technology (shanghai) Co Co., Ltd.",
  "永城市星鸿运输有限公司": "Yongcheng Xinghong Transportation Co Co., Ltd.",
  "平乡县德丰机动车充电站（个体工商户）": "Pingxiangxiandefengjidongchechongdianzhan（getigongshanghu）, Charging",
  "湖北省星鑫快充新能源有限公司": "Hubei Xingxin Fast Charging New Energy Co Co., Ltd.",
  "周口志宇新能源科技有限公司": "Zhoukou Zhiyu New Energy Technology Co Co., Ltd.",
  "漳平市钟利运输有限公司": "Zhangping Zhongli Transportation Co Co., Ltd.",
  "唐山睿驰物流有限公司": "Tangshan Ruichi Logistics Co Co., Ltd.",
  "河南浩海运输有限公司": "Henan Haohai Transportation Co Co., Ltd.",
  "古县亨通新能源快速充电有限公司": "Guxian Hengtong New Energy Fast Charging Co Co., Ltd.",
  "鹤壁运良新能源汽车有限公司浚县屯子分公司": "Hebi Yunliang New Energy Vehicle Co., . Junxian Tunzi Branch Co., Ltd.",
  "山西海之星新能源有限公司": "Shanxi Haizhixing New Energy Co Co., Ltd.",
  "邢台襄建建设工程股份有限公司": "Xingtai Xiangjian Construction Engineering Co Co., Ltd.",
  "海南恒翔佳新能源科技有限公司": "Hainan Hengxiangjia New Energy Technology Co Co., Ltd.",
  "洛阳伊电油气服务有限公司": "Luoyang Yidian Oil and Gas Service Co Co., Ltd.",
  "曲沃新睿科技有限公司": "Quwo Xinrui Technology Co Co., Ltd.",
  "安泽四通新能源有限公司": "Anze Sitong New Energy Co Co., Ltd.",
  "江苏力好新能源运营科技有限公司": "Jiangsu Lihao New Energy Operation Technology Co Co., Ltd.",
  "甘洛县甘雨建设开发服务有限责任公司": "Ganluo County Ganyu Construction and Development Service Co Co., Ltd.",
  "高平市亿达物流有限公司": "Gaoping Yida Logistics Co Co., Ltd.",
  "忻州市燃气慕山加气站有限公司": "Xinzhou Gas Mushan Gas Filling Station Co Co., Ltd.",
  "临漳县奕辰新能源科技有限公司": "Linzhang County Yichen New Energy Technology Co Co., Ltd.",
  "北海威盛新能源有限公司": "Beihai Via New Energy Co Co., Ltd.",
  "云南博能燃气有限公司": "Yunnan Boneng Gas Co Co., Ltd.",
  "对外开发": "External Development",
  "梅州市易成汽车贸易有限公司": "Meizhou Yicheng Automobile Trading Co Co., Ltd.",
  "内部专用": "Internal Dedicated",
  "山西省神华产业科技有限公司": "Shanxi Shenhua Industrial Technology Co Co., Ltd.",
  "吕梁懿鑫隆科技有限公司": "Luliang Yixinlong Technology Co Co., Ltd.",
  "威海市忠盈土石方工程有限公司": "Weihai Zhongying Earthwork Engineering Co Co., Ltd.",
  "新疆天富天然燃气有限公司": "Xinjiang Tianfu Natural Gas Co Co., Ltd.",
  "山西扬风驰骏新能源科技有限公司": "Shanxi Yangfeng Chijun New Energy Technology Co Co., Ltd.",
  "中基建建设科技（山西）有限公司": "China Infrastructure Construction Technology (shanxi) Co Co., Ltd.",
  "山西特来电机动车充电服务有限公司": "Shanxi Telaidian Motor Vehicle Charging Service Co Co., Ltd.",
  "禹州市意鑫新能源科技有限公司": "Yuzhou Yixin New Energy Technology Co Co., Ltd.",
  "沁源县晋德商贸有限公司": "Qinyuan County Jinde Trading Co Co., Ltd.",
  "吕梁市众森新能源科技有限公司": "Luliang Zhongsen New Energy Technology Co Co., Ltd.",
  "石家庄森烁停车服务有限公司": "Shijiazhuang Senshuo Parking Service Co Co., Ltd.",
  "平顶山市慧灵新能源科技有限公司": "Pingdingshan Huiling New Energy Technology Co Co., Ltd.",
  "一期": "Phase 1",
  "荆州市美盛建筑材料有限公司": "Jingzhou Meisheng Building Materials Co Co., Ltd.",
  "河北益筑建材科技有限公司": "Hebei Yizhu Building Materials Technology Co Co., Ltd.",
  "大同市盈瑞物资有限公司": "Datong Yingrui Materials Co Co., Ltd.",
  "山西恒源达新能源科技有限公司": "Shanxi Hengyuanda New Energy Technology Co Co., Ltd.",
  "寿阳县冠豪能源有限公司": "Shouyang Guanhao Energy Co Co., Ltd.",
  "邯郸擎天贸易有限公司": "Handan Qingtian Trading Co Co., Ltd.",
  "河曲县森达充电站（个体工商户）": "Hequxiansendachongdianzhan（getigongshanghu）, Charging",
  "佛山市三水雄耀运输有限公司": "Foshan Sanshui Xiongyao Transportation Co Co., Ltd.",
  "深圳市网云智慧能源有限公司": "Shenzhen Netyun Smart Energy Co Co., Ltd.",
  "星充协和": "Star Consolidation Union",
  "长治市沐荣新能源有限公司": "Changzhi Murong New Energy Co Co., Ltd.",
  "惠州市成琳橡胶制品有限公司": "Huizhou Chenglin Rubber Products Co Co., Ltd.",
  "宁晋县新纪元建材有限公司": "Ningjin County Xinjiyuan Building Materials Co Co., Ltd.",
  "云南瑞和锦程新能源有限公司": "Yunnan Ruihe Jincheng New Energy Co Co., Ltd.",
  "云南霞云成工贸有限公司": "Yunnan Xiayuncheng Industry and Trade Co Co., Ltd.",
  "大理海建物流有限公司": "Dali Haijian Logistics Co Co., Ltd.",
  "巨鹿县百业通综合服务有限公司": "Julu County Baiyetong Comprehensive Service Co Co., Ltd.",
  "襄汾市龙飞新能源科技有限公司": "Xiangfen Longfei New Energy Technology Co Co., Ltd.",
  "长治市男辰建材有限公司": "Changzhi Nanchen Building Materials Co Co., Ltd.",
  "石家庄利民预制构件有限公司": "Shijiazhuang Limin Prefabricated Components Co Co., Ltd.",
  "福州闵恒运输有限公司": "Fuzhou Minheng Transportation Co Co., Ltd.",
  "中石油新疆销售有限公司吐鲁番分公司": "Turpan Branch of Cnpc Xinjiang Sales Co Co., Ltd.",
  "太原顺联充电服务有限公司": "Taiyuan Shunlian Charging Service Co Co., Ltd.",
  "平乡县润顺机动车充电服务有限公司": "Pingxiang County Runshun Motor Vehicle Charging Service Co Co., Ltd.",
  "柳林县喜洋洋新能源科技有限公司": "Liulin County Xiyangyang New Energy Technology Co Co., Ltd.",
  "蕉岭县联兴环保建材有限公司": "Jiaoling County Lianxing Environmental Protection Building Materials Co Co., Ltd.",
  "上海瓴雄科技有限公司": "Shanghai Lingxiong Technology Co Co., Ltd.",
  "盐亭郑宏商贸有限公司": "Yanting Zhenghong Trading Co Co., Ltd.",
  "晋城市振博建材有限公司": "Jincheng Zhenbo Building Materials Co Co., Ltd.",
  "舞钢市和达物流运输有限公司": "Wugang Heda Logistics and Transportation Co Co., Ltd.",
  "朝阳众安物流有限公司": "Chaoyang Zhong'an Logistics Co Co., Ltd.",
  "临汾市利驰新能源物流运输有限公司": "Linfen Lichi New Energy Logistics and Transportation Co Co., Ltd.",
  "重卡充电": "Heavy Truck Charging",
  "沧州鸿贸新能源有限公司": "Cangzhou Hongmao New Energy Co Co., Ltd.",
  "新绛县兴泽运输有限公司": "Xinxiang County Xingze Transportation Co Co., Ltd.",
  "曲周县现岭租赁场": "Quzhou County Xianling Rental Site",
  "滦州市中昇新能源有限公司": "Luanzhou Zhongsheng New Energy Co Co., Ltd.",
  "深圳市舒速充新能源技术有限公司": "Shenzhen Shusuchong New Energy Technology Co Co., Ltd.",
  "山西同源能源发展有限公司": "Shanxi Tongyuan Energy Development Co Co., Ltd.",
  "迅能来（郑州）实业有限公司": "Xunnenglai (zhengzhou) Industrial Co Co., Ltd.",
  "邢台绍贤新能源科技有限公司": "Xingtai Shaoxian New Energy Technology Co Co., Ltd.",
  "山西通宁建筑工程有限公司": "Shanxi Tongning Construction Engineering Co Co., Ltd.",
  "山西高继新能源有限公司": "Shanxi Gaoji New Energy Co Co., Ltd.",
  "潍坊市和邦新能源科技有限公司": "Weifang Hebang New Energy Technology Co Co., Ltd.",
  "郑州满盈新能源有限公司": "Zhengzhou Manying New Energy Co Co., Ltd.",
  "永州市润春新能源科技有限公司": "Yongzhou Runchun New Energy Technology Co Co., Ltd.",
  "霍城县醇电商贸有限公司": "Huocheng County Chunelectronic Trading Co Co., Ltd.",
  "保定保雄物流运输有限公司": "Baoding Baoxiong Logistics and Transportation Co Co., Ltd.",
  "福建星充新能源科技有限公司": "Fujian Xingchong New Energy Technology Co Co., Ltd.",
  "玉溪市国有资产经营有限责任公司": "Yuxi State-Owned Assets Management Co Co., Ltd.",
  "洪洞县鑫昇充电站有限公司": "Hongdong County Xinsheng Charging Station Co Co., Ltd.",
  "五华县昇通建材有限公司": "Wuhua County Shengtong Building Materials Co Co., Ltd.",
  "烟台市金山燃气有限公司": "Yantai Jinshan Gas Co Co., Ltd.",
  "秦皇岛兴帮货物仓储有限公司": "Qinhuangdao Xingbang Cargo Warehousing Co Co., Ltd.",
  "山东辉诺汽车服务有限公司": "Shandong Huinuo Automobile Service Co Co., Ltd.",
  "山东速航新能源有限公司": "Shandong Suhang New Energy Co Co., Ltd.",
  "石家庄正隆新能源科技有限公司": "Shijiazhuang Zhenglong New Energy Technology Co Co., Ltd.",
  "四川骐骥华玮新能源有限公司": "Sichuan Qiji Huawei New Energy Co Co., Ltd.",
  "张家界市交投能源开发经营有限公司": "Zhangjiajie Jiaotong Energy Development and Management Co Co., Ltd.",
  "四会市交通实业有限公司": "Sihui Transportation Industry Co Co., Ltd.",
  "佛山市南海区喜程新能源科技有限公司": "Foshan Nanhai District Xicheng New Energy Technology Co Co., Ltd.",
  "清丰县博电新能源科技有限公司": "Qingfeng County Bodian New Energy Technology Co Co., Ltd.",
  "河北雄安都尚新能源科技有限公司": "Hebei Xiong'an Dushang New Energy Technology Co Co., Ltd.",
  "漳州天天快充新能源有限公司": "Zhangzhou Tiantian Fast Charging New Energy Co Co., Ltd.",
  "驻马店星晨新能源有限公司": "Zhumadian Xingchen New Energy Co Co., Ltd.",
  "成都正弘行物流有限公司": "Chengdu Zhenghongxing Logistics Co Co., Ltd.",
  "泉州万亿物流有限公司": "Quanzhou Wanyi Logistics Co Co., Ltd.",
  "长治县聚兴洗煤有限公司": "Changzhi Juxing Coal Washing Co Co., Ltd.",
  "山西蓝奥新能源科技有限公司": "Shanxi Lanao New Energy Technology Co Co., Ltd.",
  "信电电器集团有限公司": "Xindian Electrical Appliances Group Co Co., Ltd.",
  "成都汇意电新能源科技有限公司": "Chengdu Huiyidian New Energy Technology Co Co., Ltd.",
  "保定渤通物流有限公司": "Baoding Botong Logistics Co Co., Ltd.",
  "山西森凯科技有限公司": "Shanxi Senkai Technology Co Co., Ltd.",
  "梁山征途新能源有限公司": "Liangshan Zhengtu New Energy Co Co., Ltd.",
  "临汾市博森仓储物流有限公司": "Linfen Bosen Warehousing and Logistics Co Co., Ltd.",
  "山西禾丰新能源科技有限公司": "Shanxi Hefeng New Energy Technology Co Co., Ltd.",
  "四川能投综合能源有限责任公司": "Sichuan Energy Investment Comprehensive Energy Co Co., Ltd.",
  "四川武阳新能源开发有限公司": "Sichuan Wuyang New Energy Development Co Co., Ltd.",
  "延津县延北充电桩有限公司": "Yanjin County Yanbei Charging Pile Co Co., Ltd.",
  "朔州市朔城区盛通智慧项目管理有限公司": "Shuozhou Shuocheng District Shengtong Smart Project Management Co Co., Ltd.",
  "成都科星电路电器有限公司": "Chengdu Kexing Circuit Electrical Appliances Co Co., Ltd.",
  "云南致和运输有限公司": "Yunnan Zhihe Transportation Co Co., Ltd.",
  "宁晋县翔利新能源科技有限公司": "Ningjin Xiangli New Energy Technology Co Co., Ltd.",
  "乌鲁木齐泓翌汇能新能源技术有限公司": "Urumqi Hongyi Huineng New Energy Technology Co Co., Ltd.",
  "37号煤场旁": "Next to Coal Farm No. 37",
  "曲沃县博源极速充电站有限公司": "Quwo County Boyuan Speed ​​charging Station Co Co., Ltd.",
  "孝义恒山物流仓储有限公司": "Xiaoyi Hengshan Logistics and Warehousing Co Co., Ltd.",
  "湖北万帮数字能源有限公司": "Hubei Wanbang Digital Energy Co Co., Ltd.",
  "自贡鑫妍新能源有限公司": "Zigong Xinyan New Energy Co Co., Ltd.",
  "四川迅捷力能源有限责任公司": "Sichuan Xunjieli Energy Co Co., Ltd.",
  "山西瑞聚鑫商贸有限公司": "Shanxi Ruijuxin Trading Co Co., Ltd.",
  "厦门星充新能源科技有限公司": "Xiamen Xingchong New Energy Technology Co Co., Ltd.",
  "悠瑞联珂能源科技（辽宁）有限公司": "Yourui Lianke Energy Technology (liaoning) Co Co., Ltd.",
  "周口志宇新能源科技有限公司淮阳分公司": "Zhoukou Zhiyu New Energy Technology Co., . Huaiyang Branch Co., Ltd.",
  "河源市恒茂新能源汽车服务有限公司": "Heyuan Hengmao New Energy Vehicle Service Co Co., Ltd.",
  "金泰汽车城站": "Jintai Motor City Station",
  "忻州市海瑞通运输有限公司": "Xinzhou Hairuitong Transportation Co Co., Ltd.",
  "贵州红顺长运新能源（集团）有限公司": "Guizhou Hongshun Changyun New Energy (group) Co Co., Ltd.",
  "深圳市金恒盛置业有限公司": "Shenzhen Jinhengsheng Real Estate Co Co., Ltd.",
  "唐山宏浩源新兴能源有限责任公司": "Tangshan Honghaoyuan Xinxing Energy Co Co., Ltd.",
  "湖南朗鑫实业发展有限公司": "Hunan Langxin Industrial Development Co Co., Ltd.",
  "四川云路飞新能源科技有限公司": "Sichuan Yunlufei New Energy Technology Co Co., Ltd.",
  "天津盛泽工贸有限公司": "Tianjin Shengze Industry and Trade Co Co., Ltd.",
  "曲靖大爨商贸有限公司": "Qujing Dacun Trading Co Co., Ltd.",
  "四川省顺远鸿成建材有限公司": "Sichuan Shunyuan Hongcheng Building Materials Co Co., Ltd.",
  "上海福禄九阳供应链有限公司": "Shanghai Fulu Jiuyang Supply Chain Co Co., Ltd.",
  "福建三明格辉新能源科技有限公司": "Fujian Sanming Gehui New Energy Technology Co Co., Ltd.",
  "柳林县国兴绿色新能源充电站有限公司": "Liulin County Guoxing Green New Energy Charging Station Co Co., Ltd.",
  "保定丰硕达充电服务有限公司": "Baoding Fengshuoda Charging Service Co Co., Ltd.",
  "河北威腾电气科技有限公司": "Hebei Weiteng Electric Technology Co Co., Ltd.",
  "石家庄振业物流有限公司": "Shijiazhuang Zhenye Logistics Co Co., Ltd.",
  "安岳县顺通达运业有限责任公司": "Anyue County Shuntongda Transportation Co Co., Ltd.",
  "唐山威倍通新能源物流产业发展有限公司": "Tangshan Weibeitong New Energy Logistics Industry Development Co Co., Ltd.",
  "山西硕电新能源科技有限公司": "Shanxi Shuodian New Energy Technology Co Co., Ltd.",
  "河南省新世纪建设工程有限公司": "Henan New Century Construction Engineering Co Co., Ltd.",
  "文水县昌运能源有限公司": "Wenshui County Changyun Energy Co Co., Ltd.",
  "贵州哆啦智运供应链管理有限公司": "Guizhou Doraemon Supply Chain Management Co Co., Ltd.",
  "速溢（山西）新能源科技有限公司": "Suyi (shanxi) New Energy Technology Co Co., Ltd.",
  "长治市晋福源经贸有限公司": "Changzhi Jinfuyuan Economic and Trade Co Co., Ltd.",
  "四川云朵新能源有限公司": "Sichuan Yunduo New Energy Co Co., Ltd.",
  "灵石县亚隆贸易有限公司": "Lingshi County Yalong Trading Co Co., Ltd.",
  "福州勇通电子有限公司": "Fuzhou Yongtong Electronics Co Co., Ltd.",
  "海阳市恒鑫新能源有限公司": "Haiyang Hengxin New Energy Co Co., Ltd.",
  "寻甸宏达免烧砖厂": "Xundian Hongda Burning-Free Brick Factory",
  "遵化凌翼运输有限公司": "Zunhua Lingyi Transportation Co Co., Ltd.",
  "大巴可充": "Bus Rechargeable",
  "太原市统源能源有限公司": "Taiyuan Tongyuan Energy Co Co., Ltd.",
  "河北盛鸿新能源科技有限公司": "Hebei Shenghong New Energy Technology Co Co., Ltd.",
  "星星充电": "StarCharge",
  "河南电宏新能源科技有限公司": "Henan Dianhong New Energy Technology Co Co., Ltd.",
  "洛阳铭鑫充电科技有限公司": "Luoyang Mingxin Charging Technology Co Co., Ltd.",
  "山西交控新能源发展有限公司": "Shanxi Jiaoguan New Energy Development Co Co., Ltd.",
  "山西安迪能源开发有限责任公司": "Shanxi Andi Energy Development Co Co., Ltd.",
  "晋州市闲园民宿服务有限公司": "Jinzhoushixianyuanminsufuwuyouxiangongsi Co., Ltd.",
  "内黄县国联汽车服务有限公司": "Neihuang County Guolian Automobile Service Co Co., Ltd.",
  "乐至县兴伟建筑工程有限责任公司": "Lezhi County Xingwei Construction Engineering Co Co., Ltd.",
  "山西嘉瑞兴新能源科技有限公司": "Shanxi Jiaruixing New Energy Technology Co Co., Ltd.",
  "山西恒生源科技有限公司": "Shanxi Hengshengyuan Technology Co Co., Ltd.",
  "惠州市碧富缘能源投资有限公司": "Huizhou Bifuyuan Energy Investment Co Co., Ltd.",
  "长治市甲辰能源科技有限公司": "Changzhi Jiachen Energy Technology Co Co., Ltd.",
  "石家庄速充汽车服务有限公司": "Shijiazhuang Quick Charge Auto Service Co Co., Ltd.",
  "山西路桥集团交通机电工程有限公司新能源分公司": "Shanxiluqiaojituanjiaotongjidiangongchengyouxiangongsixinnengyuanfengongsi Co., Ltd.",
  "巩义市佰源新能源科技有限公司": "Gongyi Baiyuan New Energy Technology Co Co., Ltd.",
  "河津市汽车客运站": "Hejin Bus Passenger Station",
  "海口临沃工程机械有限公司": "Haikou Linwo Engineering Machinery Co Co., Ltd.",
  "淄博凯威光伏发电有限公司": "Zibo Kaiwei Photovoltaic Power Generation Co Co., Ltd.",
  "河南省金瑞航新能源汽车销售有限公司": "Henan Jinruihang New Energy Vehicle Sales Co Co., Ltd.",
  "上海安捷佳新能源科技有限公司": "Shanghai Anjiejia New Energy Technology Co Co., Ltd.",
  "普洱合伟新能源服务有限公司": "Pu'er Hewei New Energy Service Co Co., Ltd.",
  "承德朗鑫悦运输有限公司": "Chengde Lang Xinyue Transportation Co Co., Ltd.",
  "山西鑫明新能源服务有限公司": "Shanxi Xinming New Energy Service Co Co., Ltd.",
  "中石油新疆销售有限公司昌吉分公司": "Changji Branch of Cnpc Xinjiang Sales Co Co., Ltd.",
  "长治晋友新能源发展有限公司": "Changzhi Jinyou New Energy Development Co Co., Ltd.",
  "天津海新物流有限公司": "Tianjin Haixin Logistics Co Co., Ltd.",
  "泉州聚泰物流有限公司": "Quanzhou Jutai Logistics Co Co., Ltd.",
  "天津德安通物流有限公司": "Tianjin Deantong Logistics Co Co., Ltd.",
  "万帮之星新能源科技（上海）有限公司": "Wanbang Star New Energy Technology (shanghai) Co Co., Ltd.",
  "沈阳星星新能源有限公司": "Shenyang Xingxing New Energy Co Co., Ltd.",
  "太原市瑞东南建材有限公司": "Taiyuan Ruinan Building Materials Co Co., Ltd.",
  "河南双龙混凝土有限公司": "Henan Shuanglong Concrete Co Co., Ltd.",
  "常州城建星充新能源有限公司": "Changzhou Chengjianxing Chong New Energy Co Co., Ltd.",
  "孝义市青诚新能源科技有限公司": "Xiaoyi Qingcheng New Energy Technology Co Co., Ltd.",
  "四川东财资产管理集团有限公司": "Sichuan Dongcai Asset Management Group Co Co., Ltd.",
  "滦南县辉腾新能源科技有限公司": "Luannan Huiteng New Energy Technology Co Co., Ltd.",
  "西平县万迪新能源有限公司": "Xiping Wandi New Energy Co Co., Ltd.",
  "北京京电广通建设工程有限公司": "Beijing Beijing Dian Guangtong Construction Engineering Co Co., Ltd.",
  "琼海安特机动车辆检测有限公司": "Qionghai Ante Motor Vehicle Inspection Co Co., Ltd.",
  "晋州翊森房地产开发有限公司": "Jinzhou Yisen Real Estate Development Co Co., Ltd.",
  "福建招商太武投资运营有限公司": "Fujian China Merchants Taiwu Investment Operation Co Co., Ltd.",
  "南宫市速通充电站有限公司": "Nangong Sutong Charging Station Co Co., Ltd.",
  "深圳市陆特易新能源有限公司": "Shenzhen Luteyi New Energy Co Co., Ltd.",
  "临颍县新昕新能源科技有限公司": "Linying County Xinxin New Energy Technology Co Co., Ltd.",
  "保定聚湘城新能源科技有限公司": "Baoding Juxiangcheng New Energy Technology Co Co., Ltd.",
  "保定联孚汇新能源科技有限公司": "Baoding Lianfuhui New Energy Technology Co Co., Ltd.",
  "禹州市小目标运输有限公司": "Yuzhou Xiaotu Transportation Co Co., Ltd.",
  "山西万科新能源科技有限公司": "Shanxi Vanke New Energy Technology Co Co., Ltd.",
  "深圳市联祥发物业管理有限公司": "Shenzhen Lianxiangfa Property Management Co Co., Ltd.",
  "禹州市鸿友运输有限公司": "Yuzhou Hongyou Transportation Co Co., Ltd.",
  "成都福聚鑫能科技有限公司": "Chengdu Fujuxinneng Technology Co Co., Ltd.",
  "巩义市新慧安建材贸易有限公司": "Gongyi Xinhui'an Building Materials Trading Co Co., Ltd.",
  "呼图壁星安新能源有限公司": "Hutubi Xing'an New Energy Co Co., Ltd.",
  "河南五牛新能源科技有限公司": "Henan Wuniu New Energy Technology Co Co., Ltd.",
  "邯郸市邯钢附属企业公司": "Handan Handan Steel Affiliated Enterprise Co., Ltd.",
  "福建幸福满仓数易科技有限公司": "Fujian Xingfu Mancang Shuyi Technology Co Co., Ltd.",
  "永仁远达新能源汽车服务站": "Yongren Yuanda New Energy Vehicle Service Station",
  "石家庄诚壹鑫聚新能源科技有限公司": "Shijiazhuang Chengyixinju New Energy Technology Co Co., Ltd.",
  "平潭综合实验区宝城新能源开发有限公司": "Pingtanzongheshiyanqubaochengxinnengyuankaifayouxiangongsi Co., Ltd.",
  "昌黎县泥井镇祥伟仓储站": "Xiangwei Storage Station, Nijing Town, Changli County",
  "上海充客新能源有限公司": "Shanghai Chongke New Energy Co Co., Ltd.",
  "山西明辉钙业股份有限公司": "Shanxi Minghui Calcium Industry Co Co., Ltd.",
  "柳林县通达新能源科技有限公司": "Liulin County Tongda New Energy Technology Co Co., Ltd.",
  "兰坪县一鹤充电科技有限责任公司": "Lanping Yihe Charging Technology Co Co., Ltd.",
  "漳州市龙海区沿通新能源科技有限公司": "Zhangzhou Longhai District Yantong New Energy Technology Co Co., Ltd.",
  "驻马店智凤扬新能源有限公司": "Zhumadian Zhifengyang New Energy Co Co., Ltd.",
  "汇能（天津）新能源科技发展有限公司": "Huineng (tianjin) New Energy Technology Development Co Co., Ltd.",
  "潞城市莱盛物流有限公司": "Lucheng Laisheng Logistics Co Co., Ltd.",
  "易慧": "Yihui",
  "防城港市众翔新能源投资有限公司": "Fangchenggang Zhongxiang New Energy Investment Co Co., Ltd.",
  "梅州市兴彩新能源有限公司": "Meizhou Xingcai New Energy Co Co., Ltd.",
  "重卡专用": "Special for Heavy Trucks",
  "永州恒丰机械有限公司": "Yongzhou Hengfeng Machinery Co Co., Ltd.",
  "临汾市恩舜科技有限公司": "Linfen Enshun Technology Co Co., Ltd.",
  "永城市星瑞运输有限公司": "Yongcheng Xingrui Transport Co Co., Ltd.",
  "富江新能源科技（武汉）有限公司": "Fujiang New Energy Technology (wuhan) Co Co., Ltd.",
  "长治市金港启航新能源科技有限公司": "Changzhi Jingang Qihang New Energy Technology Co Co., Ltd.",
  "柳林县路安物流有限公司": "Liulin County Lu'an Logistics Co Co., Ltd.",
  "河南豫顺通新能源科技有限公司": "Henan Yushuntong New Energy Technology Co Co., Ltd.",
  "陆良荣强物流有限公司": "Lu Liangrongqiang Logistics Co Co., Ltd.",
  "广东恒骏新能源有限公司": "Guangdong Hengjun New Energy Co Co., Ltd.",
  "上海易速汽车服务有限公司": "Shanghai Yisu Automobile Service Co Co., Ltd.",
  "滦南县顺昌货物运输有限公司": "Luannan County Shunchang Freight Transport Co Co., Ltd.",
  "资阳市雁江区黄有明新能源汽车充电经营部（个体工商户）": "资阳市雁江区黄有明新能源汽车充电经营部（个体工商户）, New Energy, Charging",
  "长治兴晟能源科技有限公司": "Changzhi Xingsheng Energy Technology Co Co., Ltd.",
  "安阳宏科新能源科技有限公司": "Anyang Hongke New Energy Technology Co Co., Ltd.",
  "山西慧通智能新能源科技有限公司": "Shanxi Huitong Intelligent New Energy Technology Co Co., Ltd.",
  "泉州市鲨鱼新能源科技有限公司": "Quanzhou Shark New Energy Technology Co Co., Ltd.",
  "永城市隆源运输有限公司": "Yongcheng Longyuan Transportation Co Co., Ltd.",
  "山西泽优混凝土有限公司": "Shanxi Zeyou Concrete Co Co., Ltd.",
  "河北良又信能源科技有限公司": "Hebei Liangyouxin Energy Technology Co Co., Ltd.",
  "山西潞汇通物流有限公司": "Shanxi Luhuitong Logistics Co Co., Ltd.",
  "安徽海慧供应链科技有限公司": "Anhui Haihui Supply Chain Technology Co Co., Ltd.",
  "山西晋南充电站有限公司": "Shanxi Jinnan Charging Station Co Co., Ltd.",
  "隆尧县博锐普天然气销售有限公司": "Longyao County Boruipu Natural Gas Sales Co Co., Ltd.",
  "宜宾安兴物流有限公司": "Yibin Anxing Logistics Co Co., Ltd.",
  "长治市坤州商贸有限公司": "Changzhi Kunzhou Trading Co Co., Ltd.",
  "绵阳市吉瑞物流有限公司": "Mianyang Jirui Logistics Co Co., Ltd.",
  "石家庄卓讯商贸有限公司": "Shijiazhuang Zhuoxun Trading Co Co., Ltd.",
  "上海驰云涧新能源科技有限公司": "Shanghai Chiyunjian New Energy Technology Co Co., Ltd.",
  "保定人名公交客运有限公司": "Baoding Renming Bus Passenger Transport Co Co., Ltd.",
  "太原市智晟汽车服务有限公司": "Taiyuan Zhisheng Automobile Service Co Co., Ltd.",
  "中国航油集团云南石油有限公司": "China Aviation Oil Group Yunnan Petroleum Co Co., Ltd.",
  "广东惠建电力工程有限公司": "Guangdong Huijian Electric Power Engineering Co Co., Ltd.",
  "平顶山星昱新能源科技有限公司": "Pingdingshan Xingyu New Energy Technology Co Co., Ltd.",
  "邯郸市建坤新能源科技有限公司": "Handan Jiankun New Energy Technology Co Co., Ltd.",
  "平顺县广泰和矿业有限公司": "Pingshun Guangtaihe Mining Co Co., Ltd.",
  "产业集聚区站": "Industrial Cluster Station",
  "山东润邦电力科技有限公司": "Shandong Runbang Electric Power Technology Co Co., Ltd.",
  "榆社县顺诚物流有限公司": "Yushe County Shuncheng Logistics Co Co., Ltd.",
  "云浮市新力新能源科技有限公司": "Yunfu Xinli New Energy Technology Co Co., Ltd.",
  "湖南天豪巨沣投资发展集团有限公司": "Hunan Tianhao Jufeng Investment Development Group Co Co., Ltd.",
  "方山县鹏宇储煤有限公司": "Fangshan County Pengyu Coal Storage Co Co., Ltd.",
  "郑州维晨环保能源有限公司": "Zhengzhou Weichen Environmental Protection Energy Co Co., Ltd.",
  "内蒙古强鑫丰新能源有限责任公司": "Inner Mongolia Qiangxinfeng New Energy Co Co., Ltd.",
  "宁夏兴惠新能源有限公司": "Ningxia Xinghui New Energy Co Co., Ltd.",
  "石家庄峰辉土石方工程有限公司": "Shijiazhuang Fenghui Earthwork Engineering Co Co., Ltd.",
  "福建南安市德美工贸有限公司": "Fujian Nan'an Demei Industry and Trade Co Co., Ltd.",
  "长治市晓鑫钢结构工程有限公司": "Changzhi Xiaoxin Steel Structure Engineering Co Co., Ltd.",
  "莆田市智充未来新能源科技有限公司": "Putian Zhichong Future New Energy Technology Co Co., Ltd.",
  "仁寿县公共交通客运有限公司": "Renshou County Public Transportation Passenger Transport Co Co., Ltd.",
  "石屏易行新能源服务有限公司": "Shiping Yixing New Energy Service Co Co., Ltd.",
  "交口县旺庄生铁有限责任公司": "Jiaokou County Wangzhuang Pier Iron Co Co., Ltd.",
  "唐县顺道通新能源科技有限公司": "Tangxian Shundaotong New Energy Technology Co Co., Ltd.",
  "邢台岱崧商贸有限责任公司": "Xingtai Daisong Trading Co Co., Ltd.",
  "晋州市德昱新能源科技有限公司": "Jinzhou Deyu New Energy Technology Co Co., Ltd.",
  "山西智上云天物联科技有限公司保定竞秀区第一分公司": "Shanxizhishangyuntianwuliankejiyouxiangongsibaodingjingxiuqudiyifengongsi Co., Ltd.",
  "克拉玛依市雄业商贸有限公司": "Karamay Xiongye Trading Co Co., Ltd.",
  "小车重卡大巴": "Small Car Heavy Truck Bus",
  "保定星充新能源科技有限公司": "Baoding Xingchong New Energy Technology Co Co., Ltd.",
  "楚雄市琳通达物流有限公司": "Chuxiong Lintongda Logistics Co Co., Ltd.",
  "许昌裕丰新能源有限公司": "Xuchang Yufeng New Energy Co Co., Ltd.",
  "泉州市永春县友通物流有限公司": "Quanzhou Yongchun County Youtong Logistics Co Co., Ltd.",
  "云南资水科技有限公司": "Yunnan Zishui Technology Co Co., Ltd.",
  "唐生盛昀新能源科技有限公司": "Tang Shengshengyun New Energy Technology Co Co., Ltd.",
  "山西兴瑞能源有限公司": "Shanxi Xingrui Energy Co Co., Ltd.",
  "大名县蚂蚁运输有限公司": "Daming County Ant Transportation Co Co., Ltd.",
  "青岛港顺达物流有限公司": "Qingdao Port Shunda Logistics Co Co., Ltd.",
  "大车专用": "Special for Big Car",
  "保山市昊宇建材有限公司": "Baoshan Haoyu Building Materials Co Co., Ltd.",
  "漳州沃沃新能源有限公司": "Zhangzhou Wowo New Energy Co Co., Ltd.",
  "泉州正博新能源科技有限公司": "Quanzhou Zhengbo New Energy Technology Co Co., Ltd.",
  "成都市麓达物流有限公司": "Chengdu Luda Logistics Co Co., Ltd.",
  "临沂艾淇新能源有限公司": "Linyi Aiqi New Energy Co Co., Ltd.",
  "晋中曙光混凝土配送有限公司": "Jinzhong Shuguang Concrete Distribution Co Co., Ltd.",
  "中石油新疆销售有限公司博州分公司": "Bozhou Branch of China National Petroleum Xinjiang Sales Co Co., Ltd.",
  "太原市万柏林区鑫源汽车服务经营部（个体工商户）": "Taiyuanshiwanbolinquxinyuanqichefuwujingyingbu（getigongshanghu）",
  "宣威市洪瑞农业科技发展有限公司": "Xuanwei Hongrui Agricultural Technology Development Co Co., Ltd.",
  "四川超能量新能源汽车充电服务有限责任公司": "Sichuan Chao Energy New Energy Vehicle Charging Service Co Co., Ltd.",
  "福建泉州美荣新能源有限公司": "Fujian Quanzhou Meirong New Energy Co Co., Ltd.",
  "山西省易道丰联能源有限公司": "Shanxi Yidao Fenglian Energy Co Co., Ltd.",
  "唐山市秉诺金属制品有限公司": "Tangshan Bingnuo Metal Products Co Co., Ltd.",
  "四川智慧绿动能源有限公司": "Sichuan Smart Green Energy Co Co., Ltd.",
  "漯河市轩卓实业贸易有限公司": "Luohe Xuanzhuo Industrial Trading Co Co., Ltd.",
  "开封市东基电力有限公司": "Kaifeng Dongji Electric Power Co Co., Ltd.",
  "河南正大起重设备有限公司": "Henan Zhengda Lifting Equipment Co Co., Ltd.",
  "河北领途再生物资利用有限公司": "Hebei Lingtu Recycling and Resource Utilization Co Co., Ltd.",
  "河北众信环保科技有限公司": "Hebei Zhongxin Environmental Protection Technology Co Co., Ltd.",
  "梁河县顺通工程机械租赁有限公司": "Lianghe County Shuntong Engineering Machinery Leasing Co Co., Ltd.",
  "山西陆通新能源有限公司": "Shanxi Lutong New Energy Co Co., Ltd.",
  "永春县石鼓达意汽车车身维修厂": "Yongchun County Shigu Dayi Auto Body Repair Factory",
  "长治益惠兴充电站有限公司": "Changzhi Yihuixing Charging Station Co Co., Ltd.",
  "洪洞县新里程汽车服务有限公司": "Hongdong County Xinlicheng Auto Service Co Co., Ltd.",
  "张家界豆香源新能源有限公司": "Zhangjiajie Douxiangyuan New Energy Co Co., Ltd.",
  "河北雄安雄龙新材料科技有限公司": "Hebei Xiongan Xionglong New Materials Technology Co Co., Ltd.",
  "山西亿衡能源供应链有限公司": "Shanxi Yiheng Energy Supply Chain Co Co., Ltd.",
  "鹤壁市鹤安新能源科技有限公司": "Hebi He'an New Energy Technology Co Co., Ltd.",
  "上海悠尔泊智能科技有限公司": "Shanghai Youerbo Intelligent Technology Co Co., Ltd.",
  "石家庄昊熙新能源科技有限公司": "Shijiazhuang Haoxi New Energy Technology Co Co., Ltd.",
  "武汉市能朗新能源有限责任公司": "Wuhan Nenglang New Energy Co Co., Ltd.",
  "颍上南照永顺商品混凝土有限公司": "Yingshang Nanzhao Yongshun Commodity Concrete Co Co., Ltd.",
  "云南滇东商品混凝土有限公司": "Yunnan Diandong Commercial Concrete Co Co., Ltd.",
  "长治市焕燃能源科技有限公司": "Changzhi Huanran Energy Technology Co Co., Ltd.",
  "禹州市宏建运输有限公司": "Yuzhou Hongjian Transportation Co Co., Ltd.",
  "泊头市宏达重卡能源站": "Botou Hongda Heavy Truck Energy Station",
  "南部县华捷新能源科技发展有限公司": "Nanbu County Huajie New Energy Technology Development Co Co., Ltd.",
  "中荆（荆门）产业投资有限公司": "Zhongjing (jingmen) Industrial Investment Co Co., Ltd.",
  "山西亿畅新能源有限公司": "Shanxi Yichang New Energy Co Co., Ltd.",
  "上海瓴翔科技有限公司": "Shanghai Lingxiang Technology Co Co., Ltd.",
  "望城恒盛电力电杆有限公司": "Wangcheng Hengsheng Electric Power Pole Co Co., Ltd.",
  "陕西建理智能科技有限公司": "Shaanxi Jianli Intelligent Technology Co Co., Ltd.",
  "湖南天豪巨沣新能源技术有限公司": "Hunan Tianhao Jufeng New Energy Technology Co Co., Ltd.",
  "云南充卫士能源科技有限公司": "Yunnan Chongweishi Energy Technology Co Co., Ltd.",
  "不对外开放": "Not Open to the Public",
  "常州常顺综合能源服务有限责任公司": "Changzhou Changshun Comprehensive Energy Services Co Co., Ltd.",
  "邢台市武易线材有限公司": "Xingtai Wuyi Wire Materials Co Co., Ltd.",
  "揭阳市来德顺葵新能源科技有限公司": "Jieyang Laideshunkui New Energy Technology Co Co., Ltd.",
  "四川豪充新能源科技有限公司": "Sichuan Haochong New Energy Technology Co Co., Ltd.",
  "广西星星数字能源技术有限公司": "Guangxi Xingxing Digital Energy Technology Co Co., Ltd.",
  "安阳中天商砼有限公司": "Anyang Zhongtian Commercial Concrete Co Co., Ltd.",
  "新疆晖越道路运输有限公司": "Xinjiang Huiyue Road Transport Co Co., Ltd.",
  "易门易安综合能源服务有限公司": "Yimen Yian Comprehensive Energy Services Co Co., Ltd.",
  "泉州春和新能源科技有限公司": "Quanzhou Chunhe New Energy Technology Co Co., Ltd.",
  "青岛星充新能源科技有限公司": "Qingdao Xingchong New Energy Technology Co Co., Ltd.",
  "邯郸市驰电充电桩有限公司": "Handan Chidian Charging Pile Co Co., Ltd.",
  "河北晟伦新能源科技有限公司": "Hebei Shenglun New Energy Technology Co Co., Ltd.",
  "山西跑得快道路运输有限公司保德分公司": "Baode Branch of Shanxi Paidai Road Transport Co Co., Ltd.",
  "温县鑫峰新能源科技有限公司": "Wenxian Xinfeng New Energy Technology Co Co., Ltd.",
  "石家庄青馨环保科技有限公司": "Shijiazhuang Qingxin Environmental Protection Technology Co Co., Ltd.",
  "成都市商旅交通公交运业有限公司": "Chengdu Business Travel Transportation and Bus Industry Co Co., Ltd.",
  "沁源县白狐窑加油站有限公司": "Qinyuan County Baihu Kiln Gas Station Co Co., Ltd.",
  "蒲县富隆充电有限公司": "Puxian Fulong Charging Co Co., Ltd.",
  "雷波利塔新能源汽车充电服务有限责任公司": "Lei Polita New Energy Vehicle Charging Service Co Co., Ltd.",
  "福建强胜机械设备租赁有限公司": "Fujian Qiangsheng Machinery Equipment Leasing Co Co., Ltd.",
  "山西蓝腾科技有限公司": "Shanxi Lanteng Technology Co Co., Ltd.",
  "成都双流电光年新能源科技有限公司": "Chengdu Shuangliu Light Year New Energy Technology Co Co., Ltd."
}